docs: updated graph structure
